OpenFOAM case files/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-10 -5 -10) //0
    (30 -5 -10) //1
    (30  5 -10) //2
    (-10 5 -10) //3
    (-10 -5 10) //4
    (30 -5 10) //5
    (30  5 10) //6
    (-10  5 10) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 50 100) simpleGrading (1 1 1)
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (2 1 0 3)
            (6 5 4 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (6 5 1 2)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (6 2 3 7)
        );
    }
);

// ************************************************************************* //
