OpenFOAM case files/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            forceCoeffs;
libs            ("libforces.so");

writeControl    timeStep;
timeInterval    1;

log             yes;

patches         (vtol);

rho             rhoInf;      // Indicates incompressible
rhoInf          1;           // Redundant for incompressible
liftDir         (0 1 0);
dragDir         (1 0 0);
CofR            (0.03 1.05 0.95);  // Axle midpoint on ground
pitchAxis       (0 0 1);
magUInf         25;
lRef            0.13;        // Wheelbase length
Aref            0.25;        // Estimated

/*
binData
{
    nBin        20;          // output data into 20 bins
    direction   (1 0 0);     // bin direction
    cumulative  yes;
}
*/


// ************************************************************************* //
